In [1]:
import pandas as pd 
import numpy as np

In [2]:
univ = pd.read_csv(r"D:\Datascience class\Universities.csv")

In [3]:
univ.head()

       Univ   SAT  Top10  Accept  SFRatio  Expenses  GradRate
0     Brown  1310     89      22       13     22704        94
1   CalTech  1415    100      25        6     63575        81
2       CMU  1260     62      59        9     25026        72
3  Columbia  1310     76      24       12     31510        88
4   Cornell  1280     83      33       13     21864        90

In [4]:
univ.tail()

          Univ   SAT  Top10  Accept  SFRatio  Expenses  GradRate
20   UMichigan  1180     65      68       16     15470        85
21       UPenn  1285     80      36       11     27553        90
22         UVA  1225     77      44       14     13349        92
23  UWisconsin  1085     40      69       15     11857        71
24        Yale  1375     95      19       11     43514        96

In [5]:
univ.columns

Index(['Univ', 'SAT', 'Top10', 'Accept', 'SFRatio', 'Expenses', 'GradRate'], dtype='object')

In [6]:
univ.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25 entries, 0 to 24
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Univ      25 non-null     object
 1   SAT       25 non-null     int64
 2   Top10     25 non-null     int64
 3   Accept    25 non-null     int64
 4   SFRatio   25 non-null     int64
 5   Expenses  25 non-null     int64
 6   GradRate  25 non-null     int64
dtypes: int64(6), object(1)
memory usage: 1.5+ KB

In [7]:
univ.describe()

               SAT       Top10     Accept   SFRatio      Expenses   GradRate
count    25.000000   25.000000  25.000000  25.00000     25.000000  25.000000
mean   1266.440000   76.480000  39.200000  12.72000  27388.000000  86.720000
std     108.359771   19.433905  19.727308   4.06735  14424.883165   9.057778
min    1005.000000   28.000000  14.000000   6.00000   8704.000000  67.000000
25%    1240.000000   74.000000  24.000000  11.00000  15140.000000  81.000000
50%    1285.000000   81.000000  36.000000  12.00000  27553.000000  90.000000
75%    1340.000000   90.000000  50.000000  14.00000  34870.000000  94.000000
max    1415.000000  100.000000  90.000000  25.00000  63575.000000  97.000000

In [8]:
udf = pd.read_csv(r"D:\Datascience class\Universities.csv",index_col="Univ")

In [9]:
udf.head()

           SAT  Top10  Accept  SFRatio  Expenses  GradRate
Univ
Brown     1310     89      22       13     22704        94
CalTech   1415    100      25        6     63575        81
CMU       1260     62      59        9     25026        72
Columbia  1310     76      24       12     31510        88
Cornell   1280     83      33       13     21864        90

In [10]:
udf.loc["MIT"]

SAT          1380
Top10          94
Accept         30
SFRatio        10
Expenses    34870
GradRate       91
Name: MIT, dtype: int64

In [11]:
udf.loc["Princeton"]

SAT          1375
Top10          91
Accept         14
SFRatio         8
Expenses    30220
GradRate       95
Name: Princeton, dtype: int64

### Handle Null Values

In [12]:
data =[[1,2,3,'M',23],
      [np.nan,5,6,np.nan,31],
      [7,np.nan,9,'F',12],[
          np.nan,np.nan,np.nan,'M',17
      ]]

In [13]:
dframe = pd.DataFrame(data=data,columns=['a','b','c','d','e'])
dframe

     a    b    c    d   e
0  1.0  2.0  3.0    M  23
1  NaN  5.0  6.0  NaN  31
2  7.0  NaN  9.0    F  12
3  NaN  NaN  NaN    M  17

In [14]:
dframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       2 non-null      float64
 1   b       2 non-null      float64
 2   c       3 non-null      float64
 3   d       3 non-null      object
 4   e       4 non-null      int64
dtypes: float64(3), int64(1), object(1)
memory usage: 288.0+ bytes

In [15]:
avg_a=dframe['a'].mean()
avg_b = dframe['b'].mean()
avg_c = dframe['c'].mean()

In [16]:
dframe['d'].mode()

0    M
Name: d, dtype: object

In [17]:
mode_d = dframe['d'].mode()[0]
mode_d

'M'

In [18]:
dframe.fillna(0)

     a    b    c  d   e
0  1.0  2.0  3.0  M  23
1  0.0  5.0  6.0  0  31
2  7.0  0.0  9.0  F  12
3  0.0  0.0  0.0  M  17

In [19]:
dframe.fillna({'a':avg_a,
              'b':avg_b,
              'c':avg_c,
              'd':mode_d},inplace=True)

In [20]:
dframe

     a    b    c  d   e
0  1.0  2.0  3.0  M  23
1  4.0  5.0  6.0  M  31
2  7.0  3.5  9.0  F  12
3  4.0  3.5  6.0  M  17

### Drop null Values

In [21]:
dframe = pd.DataFrame(data=data,columns=['a','b','c','d','e'])
dframe

     a    b    c    d   e
0  1.0  2.0  3.0    M  23
1  NaN  5.0  6.0  NaN  31
2  7.0  NaN  9.0    F  12
3  NaN  NaN  NaN    M  17

In [22]:
dframe.dropna()

     a    b    c  d   e
0  1.0  2.0  3.0  M  23

In [23]:
dframe.dropna(axis=1,inplace=True)

In [24]:
dframe

    e
0  23
1  31
2  12
3  17

### Handling Duplicates

In [25]:
ddup = pd.DataFrame({
    "col1":['A','A','B','B','B'],
    "col2":[2,2,2,3,3]
})
ddup

  col1  col2
0    A     2
1    A     2
2    B     2
3    B     3
4    B     3

In [26]:
ddup.duplicated()

0    False
1     True
2    False
3    False
4     True
dtype: bool

In [27]:
ddup.drop_duplicates(inplace=True)

In [28]:
ddup.reset_index(drop=True)

  col1  col2
0    A     2
1    B     2
2    B     3

### Rename a Column

In [29]:
ddup

  col1  col2
0    A     2
2    B     2
3    B     3

In [30]:
ddup.rename(columns={'col1':'grade','col2':'number'},inplace=True)

In [31]:
ddup

  grade  number
0     A       2
2     B       2
3     B       3

### Connect 2 dataframe

### Merge

In [53]:
d1 = {'movieid':[1,2,3,4,5],
     'title':['3 Idiots','2 States','Leo','RRR','Pushpa']}

In [40]:
d2 = {'memid':[1,2,3,4],
     'name':['Tom','Tim','Jon','Jim'],
     'movieid':[1,np.nan,3,5]}

In [54]:
movies = pd.DataFrame(data=d1)

In [55]:
movies

   movieid     title
0        1  3 Idiots
1        2  2 States
2        3       Leo
3        4       RRR
4        5    Pushpa

In [47]:
members = pd.DataFrame(data=d2)

In [48]:
members

   memid name  movieid
0      1  Tom      1.0
1      2  Tim      NaN
2      3  Jon      3.0
3      4  Jim      5.0

In [56]:
# Inner merge
pd.merge(movies,members,on='movieid',how='inner')

   movieid     title  memid name
0        1  3 Idiots      1  Tom
1        3       Leo      3  Jon
2        5    Pushpa      4  Jim

In [58]:
# Left merge
pd.merge(movies,members,on='movieid',how='left')

   movieid     title  memid name
0        1  3 Idiots    1.0  Tom
1        2  2 States    NaN  NaN
2        3       Leo    3.0  Jon
3        4       RRR    NaN  NaN
4        5    Pushpa    4.0  Jim

In [59]:
# Right merge
pd.merge(movies,members,on='movieid',how='right')

   movieid     title  memid name
0      1.0  3 Idiots      1  Tom
1      NaN       NaN      2  Tim
2      3.0       Leo      3  Jon
3      5.0    Pushpa      4  Jim

In [60]:
# Outer merge
pd.merge(movies,members,on='movieid',how='outer')

   movieid     title  memid name
0      1.0  3 Idiots    1.0  Tom
1      2.0  2 States    NaN  NaN
2      3.0       Leo    3.0  Jon
3      4.0       RRR    NaN  NaN
4      5.0    Pushpa    4.0  Jim
5      NaN       NaN    2.0  Tim

### Concat

In [32]:
df1 = pd.DataFrame([[1,2,3],[4,5,6,]],columns=['a','b','c'])
df1

   a  b  c
0  1  2  3
1  4  5  6

In [33]:
df2 = pd.DataFrame([[7,8,9],[10,11,12]],columns=['a','b','c'])
df2

    a   b   c
0   7   8   9
1  10  11  12

In [35]:
pd.concat([df1,df2],ignore_index=True)

    a   b   c
0   1   2   3
1   4   5   6
2   7   8   9
3  10  11  12

### Join

In [36]:
df3 = pd.DataFrame([[11,22],[77,88]],columns=['c1','c2'])
df3

   c1  c2
0  11  22
1  77  88

In [37]:
df1.join(df3)

   a  b  c  c1  c2
0  1  2  3  11  22
1  4  5  6  77  88

### Grouping records

In [61]:
sal = pd.read_csv("D:\Datasets\Salaries.csv")

In [62]:
sal.head()

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800

In [63]:
sal['rank'].unique()

array(['Prof', 'AssocProf', 'AsstProf'], dtype=object)

In [64]:
grp = sal.groupby('rank')

In [65]:
grp

In [66]:
for x,y in grp:
    print(x)
    print('_'*60)

AssocProf
____________________________________________________________
AsstProf
____________________________________________________________
Prof
____________________________________________________________

In [67]:
for x,y in grp:
    print(y)
    print('_'*60)

         rank discipline  phd  service     sex  salary
6   AssocProf          A   20       17    Male   81285
30  AssocProf          B    9        7    Male  107008
34  AssocProf          B   12        8    Male  119800
41  AssocProf          A   13        8  Female   74830
47  AssocProf          B   11       11  Female  103613
54  AssocProf          A   25       22  Female   62884
56  AssocProf          A   10        8  Female   77500
59  AssocProf          B   12       10  Female  103994
61  AssocProf          B   13       10  Female  103750
62  AssocProf          B   14        7  Female  109650
64  AssocProf          A   26       24  Female   73300
71  AssocProf          B   12        9  Female   71065
74  AssocProf          B   19        6  Female  104542
____________________________________________________________
        rank discipline  phd  service     sex  salary
12  AsstProf          B    1        0    Male   88000
16  AsstProf          B    8        3    Male   75044
17  AsstProf          B    4        0    Male   92000
20  AsstProf          B    4        4    Male   92000
22  AsstProf          A    4        2    Male   73000
23  AsstProf          A    2        0    Male   85000
28  AsstProf          B    7        2    Male   91300
38  AsstProf          B    4        3    Male   91000
42  AsstProf          B    4        2  Female   80225
43  AsstProf          B    5        0  Female   77000
46  AsstProf          B   11        3  Female   74692
50  AsstProf          B   10        5  Female   97032
53  AsstProf          A    5        3  Female   73500
55  AsstProf          A    2        0  Female   72500
57  AsstProf          A    3        1  Female   72500
60  AsstProf          B    3        3  Female   92000
66  AsstProf          A    7        6  Female   63100
68  AsstProf          A    4        2  Female   77500
70  AsstProf          A    8        3  Female   78500
____________________________________________________________
    rank discipline  phd  service     sex  salary
0   Prof          B   56       49    Male  186960
1   Prof          A   12        6    Male   93000
2   Prof          A   23       20    Male  110515
3   Prof          A   40       31    Male  131205
4   Prof          B   20       18    Male  104800
5   Prof          A   20       20    Male  122400
7   Prof          A   18       18    Male  126300
8   Prof          A   29       19    Male   94350
9   Prof          A   51       51    Male   57800
10  Prof          B   39       33    Male  128250
11  Prof          B   23       23    Male  134778
13  Prof          B   35       33    Male  162200
14  Prof          B   25       19    Male  153750
15  Prof          B   17        3    Male  150480
18  Prof          A   19        7    Male  107300
19  Prof          A   29       27    Male  150500
21  Prof          A   33       30    Male  103106
24  Prof          A   30       23    Male   91100
25  Prof          B   35       31    Male   99418
26  Prof          A   38       19    Male  148750
27  Prof          A   45       43    Male  155865
29  Prof          B   21       20    Male  123683
31  Prof          B   22       21    Male  155750
32  Prof          A   27       19    Male  103275
33  Prof          B   18       18    Male  120000
35  Prof          B   28       23    Male  126933
36  Prof          B   45       45    Male  146856
37  Prof          A   20        8    Male  102000
39  Prof          B   18       18  Female  129000
40  Prof          A   39       36  Female  137000
44  Prof          B   23       19  Female  151768
45  Prof          B   25       25  Female  140096
48  Prof          B   17       17  Female  111512
49  Prof          B   17       18  Female  122960
51  Prof          B   20       14  Female  127512
52  Prof          A   12        0  Female  105000
58  Prof          B   36       26  Female  144651
63  Prof          A   29       27  Female   91000
65  Prof          A   36       19  Female  117555
67  Prof          A   17       11  Female   90450
69  Prof          A   28        7  Female  116450
72  Prof          B   24       15  Female  161101
73  Prof          B   18       10  Female  105450
75  Prof          B   17       17  Female  124312
76  Prof          A   28       14  Female  109954
77  Prof          A   23       15  Female  109646
____________________________________________________________

In [68]:
grp.agg('mean')

                 phd    service         salary
rank
AssocProf  15.076923  11.307692   91786.230769
AsstProf    5.052632   2.210526   81362.789474
Prof       27.065217  21.413043  123624.804348

In [69]:
grp.agg(['min','max'])

          discipline     phd     service         sex       salary
                 min max min max     min max     min   max    min     max
rank
AssocProf          A   B   9  26       6  24  Female  Male  62884  119800
AsstProf           A   B   1  11       0   6  Female  Male  63100   97032
Prof               A   B  12  56       0  51  Female  Male  57800  186960

In [70]:
num_df = sal[['rank','phd','service','salary']]

In [71]:
num_grp = num_df.groupby('rank')

In [72]:
num_grp.agg('mean')

                 phd    service         salary
rank
AssocProf  15.076923  11.307692   91786.230769
AsstProf    5.052632   2.210526   81362.789474
Prof       27.065217  21.413043  123624.804348

In [75]:
num_grp.agg(['mean','min','max'])['salary']

                    mean    min     max
rank
AssocProf   91786.230769  62884  119800
AsstProf    81362.789474  63100   97032
Prof       123624.804348  57800  186960

In [77]:
num_grp.get_group('Prof')

    rank  phd  service  salary
0   Prof   56       49  186960
1   Prof   12        6   93000
2   Prof   23       20  110515
3   Prof   40       31  131205
4   Prof   20       18  104800
5   Prof   20       20  122400
7   Prof   18       18  126300
8   Prof   29       19   94350
9   Prof   51       51   57800
10  Prof   39       33  128250
11  Prof   23       23  134778
13  Prof   35       33  162200
14  Prof   25       19  153750
15  Prof   17        3  150480
18  Prof   19        7  107300
19  Prof   29       27  150500
21  Prof   33       30  103106
24  Prof   30       23   91100
25  Prof   35       31   99418
26  Prof   38       19  148750
27  Prof   45       43  155865
29  Prof   21       20  123683
31  Prof   22       21  155750
32  Prof   27       19  103275
33  Prof   18       18  120000
35  Prof   28       23  126933
36  Prof   45       45  146856
37  Prof   20        8  102000
39  Prof   18       18  129000
40  Prof   39       36  137000
44  Prof   23       19  151768
45  Prof   25       25  140096
48  Prof   17       17  111512
49  Prof   17       18  122960
51  Prof   20       14  127512
52  Prof   12        0  105000
58  Prof   36       26  144651
63  Prof   29       27   91000
65  Prof   36       19  117555
67  Prof   17       11   90450
69  Prof   28        7  116450
72  Prof   24       15  161101
73  Prof   18       10  105450
75  Prof   17       17  124312
76  Prof   28       14  109954
77  Prof   23       15  109646

In [79]:
num_grp.agg(['mean','min','max']).loc['Prof']

phd      mean        27.065217
         min         12.000000
         max         56.000000
service  mean        21.413043
         min          0.000000
         max         51.000000
salary   mean    123624.804348
         min      57800.000000
         max     186960.000000
Name: Prof, dtype: float64

In [117]:
sal.sort_values(by='rank')

         rank discipline  phd  service     sex  salary
61  AssocProf          B   13       10  Female  103750
74  AssocProf          B   19        6  Female  104542
41  AssocProf          A   13        8  Female   74830
62  AssocProf          B   14        7  Female  109650
71  AssocProf          B   12        9  Female   71065
..        ...        ...  ...      ...     ...     ...
37       Prof          A   20        8    Male  102000
76       Prof          A   28       14  Female  109954
39       Prof          B   18       18  Female  129000
44       Prof          B   23       19  Female  151768
77       Prof          A   23       15  Female  109646

[78 rows x 6 columns]

## Series

In [103]:
c1 = {'Eid':[1,2,3],
      'Ename':['Tom','Jon','Mary'],
      'Job':['Mgr','Pgmr','Clrk'],
      'Salary':[1500,2500,3500]}

In [104]:
c1

{'Eid': [1, 2, 3],
 'Ename': ['Tom', 'Jon', 'Mary'],
 'Job': ['Mgr', 'Pgmr', 'Clrk'],
 'Salary': [1500, 2500, 3500]}

In [107]:
emp = pd.DataFrame(data=c1,index=['E1','E2','E3'])

In [108]:
emp

    Eid Ename   Job  Salary
E1    1   Tom   Mgr    1500
E2    2   Jon  Pgmr    2500
E3    3  Mary  Clrk    3500

In [109]:
type(emp['Eid'])

pandas.core.series.Series

In [110]:
emp['Eid'].unique()

array([1, 2, 3], dtype=int64)

In [113]:
sal['salary'].sort_values() #Ascending Order

9      57800
54     62884
66     63100
71     71065
57     72500
       ...
31    155750
27    155865
72    161101
13    162200
0     186960
Name: salary, Length: 78, dtype: int64

In [114]:
sal['salary'].sort_values(ascending=False)

0     186960
13    162200
72    161101
27    155865
31    155750
       ...
55     72500
71     71065
66     63100
54     62884
9      57800
Name: salary, Length: 78, dtype: int64

In [115]:
sal['salary'].sort_index(ascending=False)

77    109646
76    109954
75    124312
74    104542
73    105450
       ...
4     104800
3     131205
2     110515
1      93000
0     186960
Name: salary, Length: 78, dtype: int64

In [118]:
sal['salary'].mean()

108023.78205128205

In [119]:
sal['salary'].min()

57800

In [120]:
sal['salary'].max()

186960

In [121]:
sal['salary'].count()

78

## apply()

In [130]:
def evaluate(sal):
    if sal >=150000:
        status='Excellent'
    elif sal >= 100000:
        status='Good'
    else:
        status='Ok'
    return status

In [131]:
evaluate(125000)

'Good'

In [133]:
sal['Status']=sal['salary'].apply(evaluate)

In [134]:
sal.head()

   rank discipline  phd  service   sex  salary     Status
0  Prof          B   56       49  Male  186960  Excellent
1  Prof          A   12        6  Male   93000         Ok
2  Prof          A   23       20  Male  110515       Good
3  Prof          A   40       31  Male  131205       Good
4  Prof          B   20       18  Male  104800       Good